{"backend": "tensorflow", "keras_version": "2.0.9", "config": [{"config": {"output_dim": 300, "name": "embedding_1", "embeddings_constraint": null, "input_length": 100, "trainable": false, "mask_zero": true, "dtype": "float32", "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "input_dim": 1070971, "activity_regularizer": null, "embeddings_regularizer": null, "batch_input_shape": [null, 100]}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "time_distributed_1", "layer": {"config": {"name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_constraint": null, "use_bias": false, "units": 64, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}, {"config": {"trainable": true, "name": "bidirectional_1", "merge_mode": "concat", "layer": {"config": {"unroll": false, "recurrent_constraint": null, "recurrent_regularizer": null, "implementation": 1, "kernel_constraint": null, "stateful": false, "use_bias": true, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "name": "lstm_1", "trainable": true, "activation": "tanh", "dropout": 0.5, "recurrent_dropout": 0.5, "units": 64, "bias_regularizer": null, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}}, "class_name": "Bidirectional"}, {"config": {"name": "dense_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "kernel_constraint": null, "use_bias": true, "units": 1, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}